In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
        {
         'Scores': [50, 80, 85, 75, 95, 109],
         'Position': ['Goalkeeper', 'Striker', 'Midfielder', 'Striker', 'Winger', 'Goalkeeper'],
         'is_Active': [True, False, False, True, False, True]
        }, index = ['Player1', 'Player2', 'Player3', 'Player4', 'Player5', 'Player6']
        )
df

         Scores    Position  is_Active
Player1      50  Goalkeeper       True
Player2      80     Striker      False
Player3      85  Midfielder      False
Player4      75     Striker       True
Player5      95      Winger      False
Player6     109  Goalkeeper       True

In [3]:
df.loc['Player1': 'Player3', 'Position']

Player1    Goalkeeper
Player2       Striker
Player3    Midfielder
Name: Position, dtype: object

In [4]:
df.loc[(df['Scores'] > 75) & (df['is_Active'] == True)]

         Scores    Position  is_Active
Player6     109  Goalkeeper       True

In [5]:
df.loc[lambda df: df['Position'] == 'Goalkeeper']

         Scores    Position  is_Active
Player1      50  Goalkeeper       True
Player6     109  Goalkeeper       True

In [6]:
df.loc[['Player1', 'Player2'], ['Scores']] += 5
df

         Scores    Position  is_Active
Player1      55  Goalkeeper       True
Player2      85     Striker      False
Player3      85  Midfielder      False
Player4      75     Striker       True
Player5      95      Winger      False
Player6     109  Goalkeeper       True

In [7]:
print(f"Maximum value in df: {df['Scores'].max()}")
print(f"Minimum value in df: {df['Scores'].min()}")
print(f"Median value in df: {df['Scores'].median()}")
print(f"Average value in df: {df['Scores'].mean()}")
print(f"Standart deviation in df: {df['Scores'].std()}")

Maximum value in df: 109
Minimum value in df: 55
Median value in df: 85.0
Average value in df: 84.0
Standart deviation in df: 18.275666882497067

In [8]:
df_new= pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df_new.insert(2, "newcol", [19, 19])
df_new.insert(0, "col1", [100, 100], allow_duplicates= True)
df_new

   col1  col1  col2  newcol
0   100     1     3      19
1   100     2     4      19

In [9]:
df_drop = df_new.drop(['newcol'], axis=1)
df_drop = df_drop.drop(columns=['col1'])
df_drop

   col2
0     3
1     4

In [10]:
df_digs = pd.DataFrame([[1, 2], [3, 4], [5, 6]], index=['a', 'b', 'c'], columns= ['Col1', 'Col2'])
df_digs.drop(['a'])

   Col1  Col2
b     3     4
c     5     6

In [11]:
prods = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
prods

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [12]:
prods.drop_duplicates(subset=['brand'], keep='last')

     brand style  rating
1  Yum Yum   cup     4.0
4  Indomie  pack     5.0

In [13]:
sales = pd.DataFrame({'Product': ['XBox', 'Macbook Pro', 'IPhone 17 ProMax', np.nan, '', 'Beko'],
                      'Quantity': [50, np.nan, 90, np.nan, '', 120],
                      'UnitPrice': [1300, 2000, 1500, np.nan, '', 1020]})
sales

            Product Quantity UnitPrice
0              XBox       50      1300
1       Macbook Pro      NaN      2000
2  IPhone 17 ProMax       90      1500
3               NaN      NaN       NaN
4
5              Beko      120      1020

In [14]:
sales.dropna(axis=0, how='all')

            Product Quantity UnitPrice
0              XBox       50      1300
1       Macbook Pro      NaN      2000
2  IPhone 17 ProMax       90      1500
4
5              Beko      120      1020